---
kind: enumMember
id: F:Autodesk.Revit.DB.FailureSeverity.DocumentCorruption
enum: Autodesk.Revit.DB.FailureSeverity
source: html/d0cdffe3-22c5-b764-8090-5104f044b000.htm
---
# Autodesk.Revit.DB.FailureSeverity.DocumentCorruption

Failure that forces Transaction to be rolled back as soon as possible due to known corruption to a document.
 When failure of this severity is posted, reading of information from a document is not allowed.
 The current transaction has to be rolled back first in order to work with the document.